codeigniter4-framework-b3359be/app/Controllers/ChatController.php

SELECT `id`, `sender_id`, `receiver_id`, `message`, `is_read`, `created_at`
FROM `chats`
WHERE   (
`sender_id` = '20'
AND `receiver_id` = '21'
 )
OR   (
`sender_id` = '21'
AND `receiver_id` = '20'
 )
AND `id` > '117'
ORDER BY `created_at` ASC
---
    public function getMessages($myId, $friendId)
    {
        $this->setCorsHeaders();

        $chatModel = new ChatModel();

        // 1. Memilih kolom secara spesifik agar JSON menyertakan id, sender_id, message, dan created_at
        $chatModel->select('id, sender_id, receiver_id, message, is_read, created_at');

        // 2. Setup kondisi WHERE (sender_id = $myId AND receiver_id = $friendId) OR (sender_id = $friendId AND receiver_id = $myId)
        $chatModel->groupStart()
                    ->where('sender_id', $myId)
                    ->where('receiver_id', $friendId)
                ->groupEnd()
                ->orGroupStart()
                    ->where('sender_id', $friendId)
                    ->where('receiver_id', $myId)
                ->groupEnd();

        // 3. Tambahkan kondisi last_id opsional jika ada (optimasi request)
        $lastId = $this->request->getVar('last_id');
        if (!empty($lastId) && is_numeric($lastId)) {
            $chatModel->where('id >', $lastId);
        }

        // 4. Urutkan berdasarkan created_at ASC agar seperti WhatsApp
        $messages = $chatModel->orderBy('created_at', 'ASC')->findAll();